nv-11/benchmark_results/pd-ex-databse/pd-16-gds/20251201-095429-bench.log
[2025-12-01 09:54:29] Log file: /benchmark_results/pd-only-gds/20251201-095429-bench.log
[2025-12-01 09:54:29] ==========================================
[2025-12-01 09:54:29] PD Benchmark Configuration
[2025-12-01 09:54:29] ==========================================
[2025-12-01 09:54:29] Model: /models/Qwen3-30B-A3B-Instruct-2507-FP8
[2025-12-01 09:54:29] Served Model Name: Qwen3-30B-A3B-Instruct-2507-FP8
[2025-12-01 09:54:29] Base URL: http://localhost:30805
[2025-12-01 09:54:29] Output Directory: /benchmark_results/pd-only-gds
[2025-12-01 09:54:29] Case Name: pd-only-gds
[2025-12-01 09:54:29] ------------------------------------------
[2025-12-01 09:54:29] Test Type: combined
[2025-12-01 09:54:29] Test Parameters:
[2025-12-01 09:54:29]   Number of Prompts: 160
[2025-12-01 09:54:29]   Request Rate: 128
[2025-12-01 09:54:29]   Decode Output Length: 10
[2025-12-01 09:54:29]   Input Lengths: 100 1000 10000 20000 50000
[2025-12-01 09:54:29]   Base Seed: 45
[2025-12-01 09:54:29] ------------------------------------------
[2025-12-01 09:54:29] Warmup: true
[2025-12-01 09:54:29]   Warmup Prompts: 5
[2025-12-01 09:54:29]   Warmup Input Length: 100
[2025-12-01 09:54:29]   Warmup Seed: 2
[2025-12-01 09:54:29] ==========================================
[2025-12-01 09:54:29] ==========================================
[2025-12-01 09:54:29] Running warmup...
[2025-12-01 09:54:29] ==========================================
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 09:54:33 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f42faf14360>, seed=2, num_prompts=5, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=1, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=['type=warmup'], result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 09:54:37 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [1, 1]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 35:04:11 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 5/5 [00:00<00:00, 19.62it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     5         
Maximum request concurrency:             1         
Benchmark duration (s):                  0.26      
Total input tokens:                      500       
Total generated tokens:                  5         
Request throughput (req/s):              19.60     
Output token throughput (tok/s):         19.60     
Peak output token throughput (tok/s):    5.00      
Peak concurrent requests:                5.00      
Total Token throughput (tok/s):          1980.02   
---------------Time to First Token----------------
Mean TTFT (ms):                          50.47     
Median TTFT (ms):                        49.98     
P99 TTFT (ms):                           63.23     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================
[2025-12-01 09:54:39] Warmup completed
[2025-12-01 09:54:40] ==========================================
[2025-12-01 09:54:40] Starting PD Combined Tests
[2025-12-01 09:54:40] ==========================================
[2025-12-01 09:54:40] IMPORTANT: Ensure the model is deployed in PD mode!
[2025-12-01 09:54:40] ==========================================
[2025-12-01 09:54:40] ------------------------------------------
[2025-12-01 09:54:40] Testing with input_len=100, seed=145
[2025-12-01 09:54:40] ------------------------------------------
[2025-12-01 09:54:40] ==========================================
[2025-12-01 09:54:40] Running PD Combined Test
[2025-12-01 09:54:40] Input Length: 100, Seed: 145
[2025-12-01 09:54:40] ==========================================
[2025-12-01 09:54:40] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 09:54:43 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9c0ece4220>, seed=145, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=100,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-only-gds/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 09:54:48 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 76:01:09 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:05<00:00, 31.71it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  5.05      
Total input tokens:                      15907     
Total generated tokens:                  1600      
Request throughput (req/s):              31.70     
Output token throughput (tok/s):         317.04    
Peak output token throughput (tok/s):    751.00    
Peak concurrent requests:                149.00    
Total Token throughput (tok/s):          3469.01   
---------------Time to First Token----------------
Mean TTFT (ms):                          2266.81   
Median TTFT (ms):                        2100.95   
P99 TTFT (ms):                           4263.21   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          84.75     
Median TPOT (ms):                        15.50     
P99 TPOT (ms):                           483.46    
---------------Inter-token Latency----------------
Mean ITL (ms):                           85.64     
Median ITL (ms):                         14.41     
P99 ITL (ms):                            2113.26   
==================================================
[2025-12-01 09:54:54] PD Combined test completed for input_len=100
[2025-12-01 09:54:56] Completed combined test for input_len=100
[2025-12-01 09:54:56] 
[2025-12-01 09:54:56] ------------------------------------------
[2025-12-01 09:54:56] Testing with input_len=1000, seed=1045
[2025-12-01 09:54:56] ------------------------------------------
[2025-12-01 09:54:56] ==========================================
[2025-12-01 09:54:56] Running PD Combined Test
[2025-12-01 09:54:56] Input Length: 1000, Seed: 1045
[2025-12-01 09:54:56] ==========================================
[2025-12-01 09:54:56] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 09:54:59 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb50e90c220>, seed=1045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=1000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-only-gds/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 09:55:04 [datasets.py:507] Sampling input_len from [1000, 1000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 66:14:15 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:02<00:00, 57.29it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  2.79      
Total input tokens:                      159690    
Total generated tokens:                  1600      
Request throughput (req/s):              57.28     
Output token throughput (tok/s):         572.85    
Peak output token throughput (tok/s):    744.00    
Peak concurrent requests:                132.00    
Total Token throughput (tok/s):          57746.86  
---------------Time to First Token----------------
Mean TTFT (ms):                          754.66    
Median TTFT (ms):                        429.65    
P99 TTFT (ms):                           2355.85   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          30.73     
Median TPOT (ms):                        19.90     
P99 TPOT (ms):                           266.28    
---------------Inter-token Latency----------------
Mean ITL (ms):                           30.73     
Median ITL (ms):                         12.02     
P99 ITL (ms):                            197.47    
==================================================
[2025-12-01 09:55:09] PD Combined test completed for input_len=1000
[2025-12-01 09:55:11] Completed combined test for input_len=1000
[2025-12-01 09:55:11] 
[2025-12-01 09:55:11] ------------------------------------------
[2025-12-01 09:55:11] Testing with input_len=10000, seed=10045
[2025-12-01 09:55:11] ------------------------------------------
[2025-12-01 09:55:11] ==========================================
[2025-12-01 09:55:11] Running PD Combined Test
[2025-12-01 09:55:11] Input Length: 10000, Seed: 10045
[2025-12-01 09:55:11] ==========================================
[2025-12-01 09:55:11] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 09:55:14 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8fb47d8220>, seed=10045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=10000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-only-gds/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 09:55:19 [datasets.py:507] Sampling input_len from [10000, 10000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:02 elapsed, 403:07:06 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:15<00:00, 10.54it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  15.18     
Total input tokens:                      1599978   
Total generated tokens:                  1600      
Request throughput (req/s):              10.54     
Output token throughput (tok/s):         105.43    
Peak output token throughput (tok/s):    271.00    
Peak concurrent requests:                159.00    
Total Token throughput (tok/s):          105532.81 
---------------Time to First Token----------------
Mean TTFT (ms):                          5516.86   
Median TTFT (ms):                        4708.84   
P99 TTFT (ms):                           13386.68  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          374.90    
Median TPOT (ms):                        306.61    
P99 TPOT (ms):                           1150.83   
---------------Inter-token Latency----------------
Mean ITL (ms):                           374.90    
Median ITL (ms):                         412.36    
P99 ITL (ms):                            2262.39   
==================================================
[2025-12-01 09:55:45] PD Combined test completed for input_len=10000
[2025-12-01 09:55:47] Completed combined test for input_len=10000
[2025-12-01 09:55:47] 
[2025-12-01 09:55:47] ------------------------------------------
[2025-12-01 09:55:47] Testing with input_len=20000, seed=20045
[2025-12-01 09:55:47] ------------------------------------------
[2025-12-01 09:55:47] ==========================================
[2025-12-01 09:55:47] Running PD Combined Test
[2025-12-01 09:55:47] Input Length: 20000, Seed: 20045
[2025-12-01 09:55:47] ==========================================
[2025-12-01 09:55:47] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 09:55:50 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f3e3c598220>, seed=20045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=20000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=20000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-only-gds/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 09:55:55 [datasets.py:507] Sampling input_len from [20000, 20000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:04 elapsed, 961:25:14 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:31<00:00,  5.00it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  31.99     
Total input tokens:                      3200000   
Total generated tokens:                  1600      
Request throughput (req/s):              5.00      
Output token throughput (tok/s):         50.01     
Peak output token throughput (tok/s):    130.00    
Peak concurrent requests:                159.00    
Total Token throughput (tok/s):          100079.73 
---------------Time to First Token----------------
Mean TTFT (ms):                          12224.46  
Median TTFT (ms):                        11563.17  
P99 TTFT (ms):                           28879.49  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          629.34    
Median TPOT (ms):                        726.81    
P99 TPOT (ms):                           1398.15   
---------------Inter-token Latency----------------
Mean ITL (ms):                           629.34    
Median ITL (ms):                         585.58    
P99 ITL (ms):                            3724.53   
==================================================
[2025-12-01 09:56:47] PD Combined test completed for input_len=20000
[2025-12-01 09:56:49] Completed combined test for input_len=20000
[2025-12-01 09:56:49] 
[2025-12-01 09:56:49] ------------------------------------------
[2025-12-01 09:56:49] Testing with input_len=50000, seed=50045
[2025-12-01 09:56:49] ------------------------------------------
[2025-12-01 09:56:49] ==========================================
[2025-12-01 09:56:49] Running PD Combined Test
[2025-12-01 09:56:49] Input Length: 50000, Seed: 50045
[2025-12-01 09:56:49] ==========================================
[2025-12-01 09:56:49] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-01 09:56:52 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f7798cc8220>, seed=50045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=50000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=50000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-only-gds/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-01 09:56:57 [datasets.py:507] Sampling input_len from [50000, 50000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:10 elapsed, 2357:36:52 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [01:57<00:00,  1.36it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  117.76    
Total input tokens:                      8000000   
Total generated tokens:                  1516      
Request throughput (req/s):              1.36      
Output token throughput (tok/s):         12.87     
Peak output token throughput (tok/s):    49.00     
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          67946.11  
---------------Time to First Token----------------
Mean TTFT (ms):                          48375.29  
Median TTFT (ms):                        45836.72  
P99 TTFT (ms):                           110581.75 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1057.85   
Median TPOT (ms):                        1190.74   
P99 TPOT (ms):                           1682.21   
---------------Inter-token Latency----------------
Mean ITL (ms):                           1064.54   
Median ITL (ms):                         968.61    
P99 ITL (ms):                            2867.14   
==================================================
[2025-12-01 09:59:38] PD Combined test completed for input_len=50000
[2025-12-01 09:59:40] Completed combined test for input_len=50000
[2025-12-01 09:59:40] 
[2025-12-01 09:59:40] ==========================================
[2025-12-01 09:59:40] All PD Combined Tests Completed
[2025-12-01 09:59:40] ==========================================
[2025-12-01 09:59:40] ==========================================
[2025-12-01 09:59:40] Test Results Summary
[2025-12-01 09:59:40] ==========================================
[2025-12-01 09:59:40] Results saved to: /benchmark_results/pd-only-gds/benchmark_result.json
[2025-12-01 09:59:40] Result file size: 212K
[2025-12-01 09:59:40] Total test cases: 0
0
[2025-12-01 09:59:40] ==========================================
[2025-12-01 09:59:40] Total execution time: 311 seconds
[2025-12-01 09:59:40] Test completed successfully!